Catalogs/ФункцииКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ФункцииКонвертацииСвойств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ОбщиеСвойстваГосуслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоНазначение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартныеФункции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтандартныеФункцииКонвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФункцииКонвертацииСвойств/Ext/ObjectModule.bsl
#Область ПользовательскиеФункции

Функция ЗначениеСвойства() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойства(Настройка);

КонецФункции // ()

Функция ЗначениеСвойстваВЧисло() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойстваВЧисло(Настройка);

КонецФункции

Функция ЗначениеСвойстваВДату() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ЗначениеСвойстваВДату(Настройка);

КонецФункции

Функция ТекущееЗначение() Экспорт

	МодульКонвертации = Справочники.ФункцииКонвертацииСвойств;
	
	Настройка = МодульКонвертации.ПолучитьДанныеНастройки(ЭтотОбъект, ЭтотОбъект, ЭтотОбъект.ОбъектВх);
	
	Возврат МодульКонвертации.ТекущееЗначение(Настройка);

КонецФункции

#КонецОбласти
